hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/donating/cdm/v1/VaKueOrnAbg_04/VA_KUEORN_ABG.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <v1:requestCarrierChange xmlns:v1="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
            <v1:VA-KUE-ORN>
                <v1:absender>
                    <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                </v1:absender>
                <v1:empfaenger>
                    <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                </v1:empfaenger>
                <v1:version>2</v1:version>
                <v1:endkundenvertragspartner>
                    <v1:EKPauf>
                        <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                    </v1:EKPauf>
                    <v1:EKPabg>
                        <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                    </v1:EKPabg>
                </v1:endkundenvertragspartner>
                <v1:vorabstimmungsId>${preAgreementId}</v1:vorabstimmungsId>
                <v1:kundenwunschtermin>${requestedCustomerDate}</v1:kundenwunschtermin>
                <v1:endkunde>
                    <v1:firma>
                        <v1:anrede>4</v1:anrede>
                        <v1:firmenname>Caverion Deutschland GmbH</v1:firmenname>
                    </v1:firma>
                </v1:endkunde>
                <v1:projektId>
                    <v1:projektkenner>${wbciSimulatorUseCase}</v1:projektkenner>
                </v1:projektId>
                <v1:standort>
                    <v1:strasse>
                        <v1:strassenname>Riesstr.</v1:strassenname>
                        <v1:hausnummer>25</v1:hausnummer>
                    </v1:strasse>
                    <v1:postleitzahl>82667</v1:postleitzahl>
                    <v1:ort>München</v1:ort>
                </v1:standort>
                <v1:anschlussidentifikation>
                    <v1:ONKZ>11</v1:ONKZ>
                    <v1:rufnummer>111</v1:rufnummer>
                </v1:anschlussidentifikation>
               </v1:VA-KUE-ORN>
        </v1:requestCarrierChange>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>